[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:38:5
       Header: "id",
       accessor: "id", // accessor is the "key" in the data
     },
-    {
-      Header: "Requester Email",
-      accessor: "requesterEmail",
-    },
+    {},
     {
       Header: "Team Id",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:46:5
       Header: "Team Id",
       accessor: "teamId",
     },
-    {
-      Header: "Table or Breakout Room",
-      accessor: "tableOrBreakoutRoom",
-    },
+    {},
     {
       Header: "Request Time",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:58:5
       Header: "Explanation",
       accessor: "explanation",
     },
-    {
-      Header: "Solved",
-      id: "solved",
-    },
+    {},
   ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:59:15
       accessor: "explanation",
     },
     {
-      Header: "Solved",
+      Header: "",
       id: "solved",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Solved. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:66:28
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "HelpRequestTable"),
+      ButtonColumn("Edit", "", editCallback, "HelpRequestTable"),
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:69:56
       ButtonColumn("Edit", "primary", editCallback, "HelpRequestTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "HelpRequestTable"),
+      ButtonColumn("Delete", "danger", deleteCallback, ""),
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
