[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.js:21:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `New Help Request Created - id: ${helpRequest.id} team: ${helpRequest.teamId}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Help Request Created - id: 1 team: 12"

Number of calls: 0

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestCreatePage.js:23:7
 
   const onSuccess = (helpRequest) => {
     toast(
-      `New Help Request Created - id: ${helpRequest.id} team: ${helpRequest.teamId}`,
+      ``,
     );
   };
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Help Request Created - id: 1 team: 12"
Received: ""

Number of calls: 1
