[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestEditPage.js:44:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `Help Request Updated - id: ${helpRequest.id} team: ${helpRequest.teamId}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/pages/HelpRequest/HelpRequestEditPage.js:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Help Request</h1>
-        {helpRequest && (
-          <HelpRequestForm
-            initialContents={helpRequest}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {helpRequest || <HelpRequestForm initialContents={helpRequest} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: HelpRequestEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-check-input" data-testid="HelpRequestForm-solved" id="solved" name="solved" type="checkbox" /> instead
