[Killed] BlockStatement
main/components/RecommendationRequests/RecommendationRequestTable.js:18:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/recommendationRequests/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: RecommendationRequestTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/recommendationRequests/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:61:5
       Header: "Date Needed",
       accessor: "dateNeeded",
     },
-    {
-      Header: "Done?",
-      accessor: "done",
-    },
+    {},
   ];
 
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:63:17
     },
     {
       Header: "Done?",
-      accessor: "done",
+      accessor: "",
     },
   ];
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-done"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
