[Killed] BlockStatement
main/components/Articles/ArticlesTable.js:15:34
 export default function ArticlesTable({ articles, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/articles/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/articles/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.js:38:5
       Header: "id",
       accessor: "id", // accessor is the "key" in the data
     },
-    {
-      Header: "Title",
-      accessor: "title",
-    },
+    {},
     {
       Header: "URL",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:40:17
     },
     {
       Header: "Title",
-      accessor: "title",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:51:15
       accessor: "explanation",
     },
     {
-      Header: "Email",
+      Header: "",
       accessor: "email",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:55:15
       accessor: "email",
     },
     {
-      Header: "Date Added",
+      Header: "",
       accessor: "dateAdded",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date Added. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:56:17
     },
     {
       Header: "Date Added",
-      accessor: "dateAdded",
+      accessor: "",
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-dateAdded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Articles/ArticlesTable.js:60:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "ArticlesTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "ArticlesTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:62:20
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "ArticlesTable"),
+      ButtonColumn("", "primary", editCallback, "ArticlesTable"),
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:65:30
       ButtonColumn("Edit", "primary", editCallback, "ArticlesTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "ArticlesTable"),
+      ButtonColumn("Delete", "", deleteCallback, "ArticlesTable"),
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
