[Killed] ArrowFunction
main/pages/Articles/ArticlesCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function ArticlesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (articles) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title: articles.title,
-      url: articles.url,
-      explanation: articles.explanation,
-      email: articles.email,
-      dateAdded: articles.dateAdded,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (articles) => {
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/Articles/ArticlesCreatePage.js:8:46
 import { toast } from "react-toastify";
 
 export default function ArticlesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (articles) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title: articles.title,
-      url: articles.url,
-      explanation: articles.explanation,
-      email: articles.email,
-      dateAdded: articles.dateAdded,
-    },
-  });
+  const objectToAxiosParams = (articles) => ({});
 
   const onSuccess = (articles) => {
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/Articles/ArticlesCreatePage.js:11:13
   const objectToAxiosParams = (articles) => ({
     url: "/api/articles/post",
     method: "POST",
-    params: {
-      title: articles.title,
-      url: articles.url,
-      explanation: articles.explanation,
-      email: articles.email,
-      dateAdded: articles.dateAdded,
-    },
+    params: {},
   });
 
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "dateAdded": "2022-02-02T00:00",
-   "email": "yungong@ucsb.edu",

[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.js:20:35
     },
   });
 
-  const onSuccess = (articles) => {
-    toast(
-      `New articles Created - id: ${articles.id} title: ${articles.title} url: ${articles.url} explanation: ${articles.explanation} email: ${articles.email} dateAdded: ${articles.dateAdded}`,
-    );
-  };
+  const onSuccess = (articles) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New articles Created - id: 17 title: FirstArticle url: https://www.google.com/ explanation: This is my first article email: yungong@ucsb.edu dateAdded: 2022-02-02T00:00"

Number of calls: 0

[Killed] StringLiteral
main/pages/Articles/ArticlesCreatePage.js:22:7
 
   const onSuccess = (articles) => {
     toast(
-      `New articles Created - id: ${articles.id} title: ${articles.title} url: ${articles.url} explanation: ${articles.explanation} email: ${articles.email} dateAdded: ${articles.dateAdded}`,
+      ``,
     );
   };
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New articles Created - id: 17 title: FirstArticle url: https://www.google.com/ explanation: This is my first article email: yungong@ucsb.edu dateAdded: 2022-02-02T00:00"
Received: ""

Number of calls: 1
