[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.js:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/articles?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/articles`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: ArticlesEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="ArticlesForm-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Articles/ArticlesEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (articles) => ({
-    url: "/api/articles",
-    method: "PUT",
-    params: {
-      id: articles.id,
-    },
-    data: {
-      title: articles.title,
-      url: articles.url,
-      explanation: articles.explanation,
-      email: articles.email,
-      dateAdded: articles.dateAdded,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (articles) => {
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Articles Updated - id: 17 title: SecondArticle url: https://www.baidu.com/ explanation: This is my second article email: second@ucsb.edu dateAdded: 2022-12-25T08:00"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/Articles/ArticlesEditPage.js:29:10
   );
 
   const objectToAxiosPutParams = (articles) => ({
-    url: "/api/articles",
+    url: "",
     method: "PUT",
     params: {
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Articles Updated - id: 17 title: SecondArticle url: https://www.baidu.com/ explanation: This is my second article email: second@ucsb.edu dateAdded: 2022-12-25T08:00"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.js:31:13
   const objectToAxiosPutParams = (articles) => ({
     url: "/api/articles",
     method: "PUT",
-    params: {
-      id: articles.id,
-    },
+    params: {},
     data: {
       title: articles.title,
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.js:34:11
     params: {
       id: articles.id,
     },
-    data: {
-      title: articles.title,
-      url: articles.url,
-      explanation: articles.explanation,
-      email: articles.email,
-      dateAdded: articles.dateAdded,
-    },
+    data: {},
   });
 
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"title\":\"SecondArticle\",\"url\":\"https://www.baidu.com/\",\"explanation\":\"This is my second article\",\"email\":\"second@ucsb.edu\",\"dateAdded\":\"2022-12-25T08:00\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/Articles/ArticlesEditPage.js:43:35
     },
   });
 
-  const onSuccess = (articles) => {
-    toast(
-      `Articles Updated - id: ${articles.id} title: ${articles.title} url: ${articles.url} explanation: ${articles.explanation} email: ${articles.email} dateAdded: ${articles.dateAdded}`,
-    );
-  };
+  const onSuccess = (articles) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/Articles/ArticlesEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Articles</h1>
-        {articles && (
-          <ArticlesForm
-            initialContents={articles}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="ArticlesForm-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Articles/ArticlesEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Articles</h1>
-        {articles && (
-          <ArticlesForm
-            initialContents={articles}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {articles || <ArticlesForm initialContents={articles} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="ArticlesForm-title" id="title" name="title" type="text" /> instead
