[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:61:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.diningCommonsCode && "diningCommonsCode is required. "}
+              {errors.diningCommonsCode || "diningCommonsCode is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:61:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.diningCommonsCode && "diningCommonsCode is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: /diningCommonsCode is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
